#### Terraform Validation & Plan Results
* Terraform Version 📎`1.13.4`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.ai_service.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.communication_service.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.ai_service.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.communication_service.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.communication_service.azurerm_communication_service.communication_service: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Communication/communicationServices/voi-aig-dev-acs001][0m
[0m[1mmodule.ai_service.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Insights/components/voi-aig-dev-appi001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/voi-aig-dev-uai001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mazapi_resource.subnet_container_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ConAppEnvironmentSubnet][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mmodule.ai_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001/providers/Microsoft.Authorization/roleAssignments/276acc93-729b-9c60-3859-c63cb268f835][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault_secrets_officer: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001/providers/Microsoft.Authorization/roleAssignments/6414a717-a4e8-dac1-997c-817a4d9adc98][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001/providers/Microsoft.Authorization/roleAssignments/ae79b26e-925e-2c19-1537-44231d416c86][0m
[0m[1mmodule.communication_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_communication_service: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.ai_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001][0m
[0m[1mmodule.ai_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001|applicationLogs-0][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mmodule.communication_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_communication_service: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Communication/communicationServices/voi-aig-dev-acs001][0m
[0m[1mmodule.communication_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_communication_service["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Communication/communicationServices/voi-aig-dev-acs001|applicationLogs-0][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Insights/components/voi-aig-dev-appi001][0m
[0m[1mmodule.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Insights/components/voi-aig-dev-appi001|applicationLogs-0][0m
[0m[1mazurerm_container_app_environment.container_app_environment: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ConAppPrivateEndpointSubnet][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_container_app_environment["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001|applicationLogs-0][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Network/privateEndpoints/voi-aig-dev-kv001-vault-pe][0m
[0m[1mmodule.ai_service.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Network/privateEndpoints/voi-aig-dev-ai001-account-pe][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2025-11-07T08:02:39Z][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_application_insights_connection_string: Refreshing state... [id=https://voi-aig-dev-kv001.vault.azure.net/secrets/ai-connection-string/61f11ffbd49648a79e1037c0833f9ba6][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_aoai_primary_access_key: Refreshing state... [id=https://voi-aig-dev-kv001.vault.azure.net/secrets/aoai-primary-access-key/73ca097d844b42fab851584b7aad7708][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_communication_service_primary_connection_string: Refreshing state... [id=https://voi-aig-dev-kv001.vault.azure.net/secrets/acs-connection-string/7e32ac70e15a4887868a51b1e13392e9][0m
[0m[1mmodule.ai_service.time_sleep.sleep_connectivity: Refreshing state... [id=2025-11-07T08:02:52Z][0m
[0m[1mazurerm_cognitive_account_rai_policy.cognitive_account_rai_policy: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001/raiPolicies/default][0m
[0m[1mazurerm_cognitive_deployment.cognitive_deployment_gpt_40_transcribe: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001/deployments/gpt-4o-transcribe][0m
[0m[1mazurerm_cognitive_deployment.cognitive_deployment_gpt_realtime: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001/deployments/gpt-realtime][0m
[0m[1mazurerm_container_app.container_app_backend: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/containerApps/voi-aig-dev-ca001-backend][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_app_environment[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_container_app_environment" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # azurerm_container_app.container_app_backend[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_container_app" "container_app_backend" {
      [33m~[0m[0m container_app_environment_id  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001" -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m custom_domain_verification_id = (sensitive value)
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/containerApps/voi-aig-dev-ca001-backend" -> (known after apply)
      [33m~[0m[0m latest_revision_fqdn          = "voi-aig-dev-ca001-backend--0000001.kindocean-7a8d127b.northeurope.azurecontainerapps.io" -> (known after apply)
      [33m~[0m[0m latest_revision_name          = "voi-aig-dev-ca001-backend--0000001" -> (known after apply)
      [33m~[0m[0m location                      = "northeurope" -> (known after apply)
      [31m-[0m[0m max_inactive_revisions        = 0 [90m-> null[0m[0m
        name                          = "voi-aig-dev-ca001-backend"
      [33m~[0m[0m outbound_ip_addresses         = [
          [31m-[0m[0m "20.105.70.20",
          [31m-[0m[0m "20.105.70.58",
          [31m-[0m[0m "20.105.32.76",
          [31m-[0m[0m "20.105.32.139",
          [31m-[0m[0m "20.105.33.209",
          [31m-[0m[0m "20.105.33.28",
          [31m-[0m[0m "20.105.32.212",
          [31m-[0m[0m "20.105.32.182",
          [31m-[0m[0m "20.105.33.168",
          [31m-[0m[0m "20.105.33.212",
          [31m-[0m[0m "20.105.33.155",
          [31m-[0m[0m "20.105.33.195",
          [31m-[0m[0m "20.105.69.247",
          [31m-[0m[0m "20.105.70.28",
          [31m-[0m[0m "20.105.47.15",
          [31m-[0m[0m "20.105.47.12",
          [31m-[0m[0m "4.208.220.175",
          [31m-[0m[0m "4.208.218.235",
          [31m-[0m[0m "4.208.219.44",
          [31m-[0m[0m "4.208.219.6",
          [31m-[0m[0m "20.105.124.149",
          [31m-[0m[0m "20.105.123.192",
          [31m-[0m[0m "52.178.141.116",
          [31m-[0m[0m "52.178.138.108",
          [31m-[0m[0m "52.178.138.196",
          [31m-[0m[0m "52.178.141.59",
          [31m-[0m[0m "52.178.141.173",
          [31m-[0m[0m "52.178.141.228",
          [31m-[0m[0m "52.178.139.43",
          [31m-[0m[0m "52.169.76.168",
          [31m-[0m[0m "52.178.141.140",
          [31m-[0m[0m "52.178.138.54",
          [31m-[0m[0m "20.105.123.181",
          [31m-[0m[0m "20.105.124.100",
          [31m-[0m[0m "20.123.115.147",
          [31m-[0m[0m "20.123.115.110",
          [31m-[0m[0m "4.210.23.209",
          [31m-[0m[0m "4.210.23.217",
          [31m-[0m[0m "4.210.23.181",
          [31m-[0m[0m "4.210.23.186",
          [31m-[0m[0m "132.164.140.167",
        ] -> (known after apply)
        tags                          = {
            "workload" = "voice-agent"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m
        }

      [33m~[0m[0m ingress {
          [33m~[0m[0m client_certificate_mode    = "ignore" [33m->[0m[0m "accept"
          [33m~[0m[0m custom_domain              = [] -> (known after apply)
          [31m-[0m[0m exposed_port               = 0 [90m-> null[0m[0m
          [33m~[0m[0m fqdn                       = "voi-aig-dev-ca001-backend.kindocean-7a8d127b.northeurope.azurecontainerapps.io" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m

            [90m# (1 unchanged block hidden)[0m[0m
        }

      [33m~[0m[0m template {
          [32m+[0m[0m revision_suffix                  = (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m container {
              [31m-[0m[0m args              = [] [90m-> null[0m[0m
              [31m-[0m[0m command           = [] [90m-> null[0m[0m
              [33m~[0m[0m ephemeral_storage = "2Gi" -> (known after apply)
              [33m~[0m[0m memory            = "1Gi" [33m->[0m[0m "1.0Gi"
                name              = "real-time-backend"
                [90m# (2 unchanged attributes hidden)[0m[0m

              [33m~[0m[0m liveness_probe {
                  [33m~[0m[0m termination_grace_period_seconds = 0 -> (known after apply)
                    [90m# (8 unchanged attributes hidden)[0m[0m

                    [90m# (1 unchanged block hidden)[0m[0m
                }

                [90m# (8 unchanged blocks hidden)[0m[0m
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_container_app_environment.container_app_environment[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_container_app_environment" "container_app_environment" {
      [33m~[0m[0m custom_domain_verification_id               = "009611F9D6D74DFDD6E5D2FFAE58B07528E14C191155D2E7B8F8B53AC5C7538A" -> (known after apply)
      [33m~[0m[0m default_domain                              = "kindocean-7a8d127b.northeurope.azurecontainerapps.io" -> (known after apply)
      [32m+[0m[0m docker_bridge_cidr                          = (known after apply)
      [33m~[0m[0m id                                          = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001" -> (known after apply)
      [33m~[0m[0m internal_load_balancer_enabled              = true [33m->[0m[0m false [31m# forces replacement[0m[0m
        name                                        = "voi-aig-dev-cae001"
      [32m+[0m[0m platform_reserved_cidr                      = (known after apply)
      [32m+[0m[0m platform_reserved_dns_ip_address            = (known after apply)
      [33m~[0m[0m public_network_access                       = "Disabled" -> (known after apply)
      [33m~[0m[0m static_ip_address                           = "10.3.1.51" -> (known after apply)
        tags                                        = {
            "workload" = "voice-agent"
        }
        [90m# (9 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m workload_profile {
          [31m-[0m[0m maximum_count         = 0 [90m-> null[0m[0m
          [31m-[0m[0m minimum_count         = 0 [90m-> null[0m[0m
          [31m-[0m[0m name                  = "Consumption" [90m-> null[0m[0m
          [31m-[0m[0m workload_profile_type = "Consumption" [90m-> null[0m[0m
        }
      [32m+[0m[0m workload_profile {
          [32m+[0m[0m name                  = "Consumption"
          [32m+[0m[0m workload_profile_type = "Consumption"
        }
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_container_app_environment["0"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_container_app_environment" {
      [33m~[0m[0m id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001|applicationLogs-0" -> (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
        name                           = "applicationLogs-0"
      [33m~[0m[0m target_resource_id             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m enabled_metric (known after apply)
      [31m-[0m[0m enabled_metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1mPlan:[0m 3 to add, 0 to change, 3 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with module.ai_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"],
[33m│[0m [0m  on .terraform/modules/ai_service/modules/aiservice/diagnostics.tf line 1, in resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_cognitive_account":
[33m│[0m [0m   1: resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_cognitive_account" [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0m`metric` has been deprecated in favor of the `enabled_metric` property and
[33m│[0m [0mwill be removed in v5.0 of the AzureRM provider
[33m│[0m [0m
[33m│[0m [0m(and 2 more similar warnings elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>